OdDAI.OdEntityExtent.load
\details
Loads all enitites from this entity extent container.
\returns Returns eOk if success, otherwise it should return an error code

OdDAI.OdEntityExtent.unload
\details
Unloads all enitites from this entity extent container.
\returns Returns eOk if success, otherwise it should return an error code

OdDAI.OdEntityExtent.name
\details
Returns the type name of the entity definition of this entity extent.

OdDAI.OdEntityExtent.definition(OdSmartPtr&lt;OdDAI.Entity&gt;)
\details
Sets the entity definition of this entity extent container (folder).
\param definition [in] An entity definition that is the parent definition for all entity instances contained in this entity extent.

OdDAI.OdEntityExtent.definition
\details
Returns a smart pointer to the entity definition of this entity extent.

OdDAI.OdEntityExtent.instances
\details
Returns an aggregate of object ids of entity instances for the folder.

OdDAI.OdEntityExtent
\details
This class represents a container (folder) that contains entities that
are a certain schema entity type.